#include"PacketRet.h"
#pragma pack(1)       //强制1字节对齐(保证所见即所得)


/******************************自定义好友列表数据结构*****************************************/
/******************************自定义好友列表数据结构*****************************************/

/******************************自定义接收消息数据结构*****************************************/
typedef struct _TextMsg
{
	unsigned int Uin;	//发送方
	unsigned int Time;	//时间
	std::string	 MsgContent;	//消息内容
}TextMsg,*PTextMsg;
/******************************自定义接收消息数据结构*****************************************/